data/collected_data/watermelon/api/standardb12ms/d/load.txt
Running 30m test @ http://20.117.74.7:60
  2 threads and 1000 connections
  Thread calibration: mean lat.: 8.839ms, rate sampling interval: 30ms
  Thread calibration: mean lat.: 8.725ms, rate sampling interval: 30ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.63s     2.37s   10.46s    73.60%
    Req/Sec     1.01k   289.48     1.72k    80.09%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.15s 
 75.000%    3.79s 
 90.000%    5.57s 
 99.000%   10.46s 
 99.900%   18.83s 
 99.990%   25.28s 
 99.999%   29.62s 
100.000%   33.52s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.069     0.000000            1         1.00
     114.623     0.100000       354001         1.11
     615.935     0.200000       708055         1.25
    1115.135     0.300000      1062493         1.43
    1622.015     0.400000      1416305         1.67
    2154.495     0.500000      1770190         2.00
    2437.119     0.550000      1947737         2.22
    2734.079     0.600000      2124740         2.50
    3051.519     0.650000      2301006         2.86
    3401.727     0.700000      2478093         3.33
    3794.943     0.750000      2655274         4.00
    4014.079     0.775000      2743837         4.44
    4251.647     0.800000      2832221         5.00
    4517.887     0.825000      2921318         5.71
    4812.799     0.850000      3008968         6.67
    5156.863     0.875000      3097335         8.00
    5353.471     0.887500      3141867         8.89
    5570.559     0.900000      3186388        10.00
    5816.319     0.912500      3230499        11.43
    6094.847     0.925000      3274443        13.33
    6426.623     0.937500      3318631        16.00
    6619.135     0.943750      3340805        17.78
    6836.223     0.950000      3363060        20.00
    7081.983     0.956250      3385099        22.86
    7372.799     0.962500      3407220        26.67
    7729.151     0.968750      3429329        32.00
    7938.047     0.971875      3440275        35.56
    8179.711     0.975000      3451315        40.00
    8470.527     0.978125      3462594        45.71
    8814.591     0.981250      3473524        53.33
    9248.767     0.984375      3484541        64.00
    9519.103     0.985938      3490050        71.11
    9830.399     0.987500      3495541        80.00
   10199.039     0.989062      3501097        91.43
   10657.791     0.990625      3506598       106.67
   11247.615     0.992188      3512110       128.00
   11616.255     0.992969      3514902       142.22
   12034.047     0.993750      3517671       160.00
   12533.759     0.994531      3520401       182.86
   13148.159     0.995313      3523183       213.33
   13860.863     0.996094      3525937       256.00
   14262.271     0.996484      3527319       284.44
   14704.639     0.996875      3528705       320.00
   15253.503     0.997266      3530074       365.71
   15835.135     0.997656      3531446       426.67
   16523.263     0.998047      3532845       512.00
   16891.903     0.998242      3533534       568.89
   17301.503     0.998437      3534212       640.00
   17776.639     0.998633      3534905       731.43
   18333.695     0.998828      3535616       853.33
   18890.751     0.999023      3536289      1024.00
   19234.815     0.999121      3536642      1137.78
   19562.495     0.999219      3536985      1280.00
   19955.711     0.999316      3537331      1462.86
   20381.695     0.999414      3537670      1706.67
   20889.599     0.999512      3538021      2048.00
   21151.743     0.999561      3538194      2275.56
   21495.807     0.999609      3538363      2560.00
   21905.407     0.999658      3538542      2925.71
   22331.391     0.999707      3538709      3413.33
   22790.143     0.999756      3538879      4096.00
   23035.903     0.999780      3538970      4551.11
   23330.815     0.999805      3539053      5120.00
   23707.647     0.999829      3539140      5851.43
   24166.399     0.999854      3539225      6826.67
   24707.071     0.999878      3539313      8192.00
   25083.903     0.999890      3539355      9102.22
   25362.431     0.999902      3539398     10240.00
   25739.263     0.999915      3539441     11702.86
   26116.095     0.999927      3539483     13653.33
   26443.775     0.999939      3539529     16384.00
   26656.767     0.999945      3539548     18204.44
   26968.063     0.999951      3539570     20480.00
   27213.823     0.999957      3539591     23405.71
   27410.431     0.999963      3539614     27306.67
   27639.807     0.999969      3539635     32768.00
   27869.183     0.999973      3539645     36408.89
   28033.023     0.999976      3539656     40960.00
   28213.247     0.999979      3539667     46811.43
   28524.543     0.999982      3539678     54613.33
   28983.295     0.999985      3539689     65536.00
   29114.367     0.999986      3539694     72817.78
   29360.127     0.999988      3539699     81920.00
   29589.503     0.999989      3539705     93622.86
   29720.575     0.999991      3539710    109226.67
   30179.327     0.999992      3539715    131072.00
   30277.631     0.999993      3539718    145635.56
   30457.855     0.999994      3539722    163840.00
   30670.847     0.999995      3539724    187245.71
   30736.383     0.999995      3539726    218453.33
   31064.063     0.999996      3539729    262144.00
   31080.447     0.999997      3539730    291271.11
   31375.359     0.999997      3539732    327680.00
   31473.663     0.999997      3539733    374491.43
   31637.503     0.999998      3539734    436906.67
   31735.807     0.999998      3539736    524288.00
   31735.807     0.999998      3539736    582542.22
   31752.191     0.999998      3539737    655360.00
   32112.639     0.999999      3539738    748982.86
   32112.639     0.999999      3539738    873813.33
   33112.063     0.999999      3539739   1048576.00
   33112.063     0.999999      3539739   1165084.44
   33177.599     0.999999      3539740   1310720.00
   33177.599     0.999999      3539740   1497965.71
   33177.599     0.999999      3539740   1747626.67
   33341.439     1.000000      3539741   2097152.00
   33341.439     1.000000      3539741   2330168.89
   33341.439     1.000000      3539741   2621440.00
   33341.439     1.000000      3539741   2995931.43
   33341.439     1.000000      3539741   3495253.33
   33521.663     1.000000      3539742   4194304.00
   33521.663     1.000000      3539742          inf
#[Mean    =     2632.252, StdDeviation   =     2372.593]
#[Max     =    33505.280, Total count    =      3539742]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3558565 requests in 30.00m, 1.62GB read
  Socket errors: connect 0, read 815, write 9553, timeout 16348
  Non-2xx or 3xx responses: 1
Requests/sec:   1976.98
Transfer/sec:      0.92MB